/*******************************************************************************
 ブレーキを表すクラス
*******************************************************************************/
public class Brake{
	private int push = 0;     //踏み込み量

	//---------------------------------------------------------------
	// 踏み込み量を変える
	// 引数 : d_push 踏み込みの変化量, t タイヤオブジェクト
	// 戻値 : なし
	//---------------------------------------------------------------
	public void movePush(int d_push, Tire t){
		push += d_push;
		if(push < 0){
			push = 0;
		}else if(push > 15){
			push = 15;
		}
		
		renewSpeed(t);
	}

	//---------------------------------------------------------------
	// 踏み込み量を0にする
	// 引数 : t タイヤオブジェクト
	// 戻値 : なし
	//---------------------------------------------------------------
	public void resetPush(Tire t){
		push = 0;
		renewSpeed(t);
	}

	//---------------------------------------------------------------
	// 踏み込み量を最大(15)にする
	// 引数 : t タイヤオブジェクト
	// 戻値 : なし
	//---------------------------------------------------------------
	public void fullPush(Tire t){
		push = 15;
		renewSpeed(t);
	}

	//---------------------------------------------------------------
	// 踏み込み量を得る
	// 引数 : なし
	// 戻値 : 踏み込み量
	//---------------------------------------------------------------
	public int getPush(){
		return push;
	}

	//---------------------------------------------------------------
	// タイヤの速度を変化させる
	// 引数 : t タイヤオブジェクト
	// 戻値 : なし
	//---------------------------------------------------------------
	public void renewSpeed(Tire t){
		t.changeSpeed( -push );
	}
}
