/*******************************************************************************
 ハンドルを表すクラス
*******************************************************************************/
public class Handle{
	private int direction = 0;          //角度

	//---------------------------------------------------------------
	// 角度を変える
	// 引数 : d_direction 角度の変化量, t タイヤオブジェクト
	// 戻値 : なし
	//---------------------------------------------------------------
	public void moveDirection(int d_direction, Tire t){
		direction += d_direction;
		if(direction > 90){
			direction = 90;
		}else if(direction < -90){
			direction = -90;
		}
		
		setTireDirection(t);
	}

	//---------------------------------------------------------------
	// 角度を得る
	// 引数 : なし
	// 戻値 : 角度
	//---------------------------------------------------------------
	public int getDirection(){
		return direction;
	}

	//---------------------------------------------------------------
	// 角度を0にする
	// 引数 : t タイヤオブジェクト
	// 戻値 : なし
	//---------------------------------------------------------------
	public void resetDirection(Tire t){
		direction = 0;
		setTireDirection(t);
	}

	//---------------------------------------------------------------
	// タイヤの角度を変化させる
	// 引数 : t タイヤオブジェクト
	// 戻値 : なし
	//---------------------------------------------------------------
	private void setTireDirection(Tire t){
		t.setDirection((int)(direction / 2));
	}
}
