/*******************************************************************************
 タイヤを表すクラス
*******************************************************************************/
public class Tire{
	private int direction = 0;          //角度
	private int speed = 0;              //速度

	//---------------------------------------------------------------
	// 角度を変える
	// 引数 : direction 角度
	// 戻値 : なし
	//---------------------------------------------------------------
	public void setDirection(int direction){
		if(direction > 45){
			direction = 45;
		}else if(direction < -45){
			direction = -45;
		}
		this.direction = direction;
	}

	//---------------------------------------------------------------
	// 速度を変える
	// 引数 : d_speed 速度の変化量
	// 戻値 : なし
	//---------------------------------------------------------------
	public void changeSpeed(int d_speed){
		speed += d_speed;
		if(speed < 0){
			speed = 0;
		}
	}

	//---------------------------------------------------------------
	// 角度を得る
	// 引数 : なし
	// 戻値 : 角度
	//---------------------------------------------------------------
	public int getDirection(){
		return direction;
	}

	//---------------------------------------------------------------
	// 速度を得る
	// 引数 : なし
	// 戻値 : 速度
	//---------------------------------------------------------------
	public int getSpeed(){
		return speed;
	}
}
